In [1]:
!pip install numpy
!pip install pandas

Access is denied.
Access is denied.

In [2]:
import numpy as np
import pandas as pd

uploding the data set

In [ ]:
dataset=pd.read_csv('data.csv')

In [5]:
df=pd.read_csv("D:\\Study\\AIML-D-Study\\Data_sets\\app_usage.csv")

In [6]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.0,Chennai,45.0,300.0,Free,0,4.2
1,502,35.0,Bangalore,60.0,550.0,Premium,499,4.8
2,503,NaN,Delhi,30.0,200.0,Free,0,3.9
3,504,28.0,Chennai,90.0,700.0,Basic,199,4.1
4,505,42.0,Delhi,120.0,900.0,Premium,499,4.9
5,506,31.0,Bangalore,50.0,450.0,Basic,199,NaN
6,507,NaN,Chennai,40.0,320.0,Free,0,4.0
7,508,26.0,NaN,70.0,600.0,Premium,499,4.7
8,509,38.0,Delhi,NaN,500.0,Basic,199,4.3
9,510,29.0,Bangalore,55.0,NaN,Free,0,4.1

Understanding the Data set

In [7]:
df.head()

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.0,Chennai,45.0,300.0,Free,0,4.2
1,502,35.0,Bangalore,60.0,550.0,Premium,499,4.8
2,503,NaN,Delhi,30.0,200.0,Free,0,3.9
3,504,28.0,Chennai,90.0,700.0,Basic,199,4.1
4,505,42.0,Delhi,120.0,900.0,Premium,499,4.9

In [8]:
df.tail()

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
5,506,31.0,Bangalore,50.0,450.0,Basic,199,NaN
6,507,NaN,Chennai,40.0,320.0,Free,0,4.0
7,508,26.0,NaN,70.0,600.0,Premium,499,4.7
8,509,38.0,Delhi,NaN,500.0,Basic,199,4.3
9,510,29.0,Bangalore,55.0,NaN,Free,0,4.1

In [9]:
df.head(7)

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.0,Chennai,45.0,300.0,Free,0,4.2
1,502,35.0,Bangalore,60.0,550.0,Premium,499,4.8
2,503,NaN,Delhi,30.0,200.0,Free,0,3.9
3,504,28.0,Chennai,90.0,700.0,Basic,199,4.1
4,505,42.0,Delhi,120.0,900.0,Premium,499,4.9
5,506,31.0,Bangalore,50.0,450.0,Basic,199,NaN
6,507,NaN,Chennai,40.0,320.0,Free,0,4.0

In [10]:
df.tail(7)

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
3,504,28.0,Chennai,90.0,700.0,Basic,199,4.1
4,505,42.0,Delhi,120.0,900.0,Premium,499,4.9
5,506,31.0,Bangalore,50.0,450.0,Basic,199,NaN
6,507,NaN,Chennai,40.0,320.0,Free,0,4.0
7,508,26.0,NaN,70.0,600.0,Premium,499,4.7
8,509,38.0,Delhi,NaN,500.0,Basic,199,4.3
9,510,29.0,Bangalore,55.0,NaN,Free,0,4.1

In [14]:
df.isnull()

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,True,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,True
6,False,True,False,False,False,False,False,False
7,False,False,True,False,False,False,False,False
8,False,False,False,True,False,False,False,False
9,False,False,False,False,True,False,False,False

In [15]:
df.isnull().sum()

User_ID              0
Age                  2
City                 1
Session_Duration     1
Data_Used_MB         1
Subscription_Type    0
Amount_Paid          0
App_Rating           1
dtype: int64

In [16]:
df.describe()

,User_ID,Age,Session_Duration,Data_Used_MB,Amount_Paid,App_Rating
count,10.00000,8.000000,9.000000,9.000000,10.000000,9.000000
mean,505.50000,31.375000,62.222222,502.222222,209.400000,4.333333
std,3.02765,6.588681,27.851292,217.185277,217.899671,0.370810
min,501.00000,22.000000,30.000000,200.000000,0.000000,3.900000
25%,503.25000,27.500000,45.000000,320.000000,0.000000,4.100000
50%,505.50000,30.000000,55.000000,500.000000,199.000000,4.200000
75%,507.75000,35.750000,70.000000,600.000000,424.000000,4.700000
max,510.00000,42.000000,120.000000,900.000000,499.000000,4.900000

In [11]:
df.shape

(10, 8)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   User_ID            10 non-null     int64
 1   Age                8 non-null      float64
 2   City               9 non-null      object
 3   Session_Duration   9 non-null      float64
 4   Data_Used_MB       9 non-null      float64
 5   Subscription_Type  10 non-null     object
 6   Amount_Paid        10 non-null     int64
 7   App_Rating         9 non-null      float64
dtypes: float64(4), int64(2), object(2)
memory usage: 772.0+ bytes

In [12]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.0,Chennai,45.0,300.0,Free,0,4.2
1,502,35.0,Bangalore,60.0,550.0,Premium,499,4.8
2,503,NaN,Delhi,30.0,200.0,Free,0,3.9
3,504,28.0,Chennai,90.0,700.0,Basic,199,4.1
4,505,42.0,Delhi,120.0,900.0,Premium,499,4.9
5,506,31.0,Bangalore,50.0,450.0,Basic,199,NaN
6,507,NaN,Chennai,40.0,320.0,Free,0,4.0
7,508,26.0,NaN,70.0,600.0,Premium,499,4.7
8,509,38.0,Delhi,NaN,500.0,Basic,199,4.3
9,510,29.0,Bangalore,55.0,NaN,Free,0,4.1

In [13]:
df.shape

(10, 8)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   User_ID            10 non-null     int64
 1   Age                8 non-null      float64
 2   City               9 non-null      object
 3   Session_Duration   9 non-null      float64
 4   Data_Used_MB       9 non-null      float64
 5   Subscription_Type  10 non-null     object
 6   Amount_Paid        10 non-null     int64
 7   App_Rating         9 non-null      float64
dtypes: float64(4), int64(2), object(2)
memory usage: 772.0+ bytes

In [11]:
df.describe()

,User_ID,Age,Session_Duration,Data_Used_MB,Amount_Paid,App_Rating
count,10.00000,8.000000,9.000000,9.000000,10.000000,9.000000
mean,505.50000,31.375000,62.222222,502.222222,209.400000,4.333333
std,3.02765,6.588681,27.851292,217.185277,217.899671,0.370810
min,501.00000,22.000000,30.000000,200.000000,0.000000,3.900000
25%,503.25000,27.500000,45.000000,320.000000,0.000000,4.100000
50%,505.50000,30.000000,55.000000,500.000000,199.000000,4.200000
75%,507.75000,35.750000,70.000000,600.000000,424.000000,4.700000
max,510.00000,42.000000,120.000000,900.000000,499.000000,4.900000

In [15]:
df.isnull()

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,True,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,True
6,False,True,False,False,False,False,False,False
7,False,False,True,False,False,False,False,False
8,False,False,False,True,False,False,False,False
9,False,False,False,False,True,False,False,False

In [16]:
df.isnull().sum()

User_ID              0
Age                  2
City                 1
Session_Duration     1
Data_Used_MB         1
Subscription_Type    0
Amount_Paid          0
App_Rating           1
dtype: int64

Cleaning the Data

In [17]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.0,Chennai,45.0,300.0,Free,0,4.2
1,502,35.0,Bangalore,60.0,550.0,Premium,499,4.8
2,503,NaN,Delhi,30.0,200.0,Free,0,3.9
3,504,28.0,Chennai,90.0,700.0,Basic,199,4.1
4,505,42.0,Delhi,120.0,900.0,Premium,499,4.9
5,506,31.0,Bangalore,50.0,450.0,Basic,199,NaN
6,507,NaN,Chennai,40.0,320.0,Free,0,4.0
7,508,26.0,NaN,70.0,600.0,Premium,499,4.7
8,509,38.0,Delhi,NaN,500.0,Basic,199,4.3
9,510,29.0,Bangalore,55.0,NaN,Free,0,4.1

In [18]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

C:\Users\raza\AppData\Local\Temp\ipykernel_30932\694922604.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

In [19]:
df.head()

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.000,Chennai,45.0,300.0,Free,0,4.2
1,502,35.000,Bangalore,60.0,550.0,Premium,499,4.8
2,503,31.375,Delhi,30.0,200.0,Free,0,3.9
3,504,28.000,Chennai,90.0,700.0,Basic,199,4.1
4,505,42.000,Delhi,120.0,900.0,Premium,499,4.9

In [20]:
df.isnull().sum()

User_ID              0
Age                  0
City                 1
Session_Duration     1
Data_Used_MB         1
Subscription_Type    0
Amount_Paid          0
App_Rating           1
dtype: int64

In [21]:
df['City'].fillna(df['City'].mode()[0],inplace=True)

C:\Users\raza\AppData\Local\Temp\ipykernel_30932\689064380.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna(df['City'].mode()[0],inplace=True)

In [22]:
df.isnull().sum()

User_ID              0
Age                  0
City                 0
Session_Duration     1
Data_Used_MB         1
Subscription_Type    0
Amount_Paid          0
App_Rating           1
dtype: int64

In [23]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.000,Chennai,45.0,300.0,Free,0,4.2
1,502,35.000,Bangalore,60.0,550.0,Premium,499,4.8
2,503,31.375,Delhi,30.0,200.0,Free,0,3.9
3,504,28.000,Chennai,90.0,700.0,Basic,199,4.1
4,505,42.000,Delhi,120.0,900.0,Premium,499,4.9
5,506,31.000,Bangalore,50.0,450.0,Basic,199,NaN
6,507,31.375,Chennai,40.0,320.0,Free,0,4.0
7,508,26.000,Bangalore,70.0,600.0,Premium,499,4.7
8,509,38.000,Delhi,NaN,500.0,Basic,199,4.3
9,510,29.000,Bangalore,55.0,NaN,Free,0,4.1

In [24]:
# fill age with mean
df['Age'].fillna(df['Age'].mean(), inplace=True)
# fill city with mode
df['City'].fillna(df['City'].mode()[0], inplace=True)
# fill Session_Duration with mean
df['Session_Duration'].fillna(df['Session_Duration'].mean(), inplace=True)
# fill Data_Used_MB with mean
df['Data_Used_MB'].fillna(df['Data_Used_MB'].mean(), inplace=True)
# fill 	App_Rating with mean
df['App_Rating'].fillna(df['App_Rating'].mean(), inplace=True)

C:\Users\raza\AppData\Local\Temp\ipykernel_30932\4055527612.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\raza\AppData\Local\Temp\ipykernel_30932\4055527612.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Session_Duration'].fillna(df['Session_Duration'].mean(), inplace=True)
C:\Users\raza\AppData\Local\Temp\ipykernel_30932\4055527612.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Data_Used_MB'].fillna(df['Data_Used_MB'].mean(), inplace=True)
C:\Users\raza\AppData\Local\Temp\ipykernel_30932\4055527612.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['App_Rating'].fillna(df['App_Rating'].mean(), inplace=True)

In [25]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.000,Chennai,45.000000,300.000000,Free,0,4.200000
1,502,35.000,Bangalore,60.000000,550.000000,Premium,499,4.800000
2,503,31.375,Delhi,30.000000,200.000000,Free,0,3.900000
3,504,28.000,Chennai,90.000000,700.000000,Basic,199,4.100000
4,505,42.000,Delhi,120.000000,900.000000,Premium,499,4.900000
5,506,31.000,Bangalore,50.000000,450.000000,Basic,199,4.333333
6,507,31.375,Chennai,40.000000,320.000000,Free,0,4.000000
7,508,26.000,Bangalore,70.000000,600.000000,Premium,499,4.700000
8,509,38.000,Delhi,62.222222,500.000000,Basic,199,4.300000
9,510,29.000,Bangalore,55.000000,502.222222,Free,0,4.100000

In [26]:
df.isnull().sum()

User_ID              0
Age                  0
City                 0
Session_Duration     0
Data_Used_MB         0
Subscription_Type    0
Amount_Paid          0
App_Rating           0
dtype: int64

Convert Requierd columns to Numpy array

In [23]:
age_array = df['Age'].to_numpy()

In [24]:
Session_Duration_array = df['Session_Duration'].to_numpy()

In [26]:
avg_session_duration_array = np.mean(Session_Duration_array)

In [27]:
print(avg_session_duration_array)

62.222222222222214

Identify data consuption rate

In [28]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.000,Chennai,45.000000,300.000000,Free,0,4.200000
1,502,35.000,Bangalore,60.000000,550.000000,Premium,499,4.800000
2,503,31.375,Delhi,30.000000,200.000000,Free,0,3.900000
3,504,28.000,Chennai,90.000000,700.000000,Basic,199,4.100000
4,505,42.000,Delhi,120.000000,900.000000,Premium,499,4.900000
5,506,31.000,Bangalore,50.000000,450.000000,Basic,199,4.333333
6,507,31.375,Chennai,40.000000,320.000000,Free,0,4.000000
7,508,26.000,Bangalore,70.000000,600.000000,Premium,499,4.700000
8,509,38.000,Delhi,62.222222,500.000000,Basic,199,4.300000
9,510,29.000,Bangalore,55.000000,502.222222,Free,0,4.100000

In [29]:
Data_Used_per_Min = df["Data_Used_MB"] / df["Session_Duration"]

In [30]:
print(Data_Used_per_Min)

0    6.666667
1    9.166667
2    6.666667
3    7.777778
4    7.500000
5    9.000000
6    8.000000
7    8.571429
8    8.035714
9    9.131313
dtype: float64

Detect High Usage Sessions

In [31]:
high_usage_session = df[(df["Session_Duration"] > 60)]
print(high_usage_session)

   User_ID   Age       City  Session_Duration  Data_Used_MB Subscription_Type  \
3      504  28.0    Chennai         90.000000         700.0             Basic
4      505  42.0      Delhi        120.000000         900.0           Premium
7      508  26.0  Bangalore         70.000000         600.0           Premium
8      509  38.0      Delhi         62.222222         500.0             Basic

   Amount_Paid  App_Rating
3          199         4.1
4          499         4.9
7          499         4.7
8          199         4.3

In [32]:
high_usage_session1 = df[(df["Data_Used_MB"] > 500)]
print(high_usage_session1)

   User_ID   Age       City  Session_Duration  Data_Used_MB Subscription_Type  \
1      502  35.0  Bangalore              60.0    550.000000           Premium
3      504  28.0    Chennai              90.0    700.000000             Basic
4      505  42.0      Delhi             120.0    900.000000           Premium
7      508  26.0  Bangalore              70.0    600.000000           Premium
9      510  29.0  Bangalore              55.0    502.222222              Free

   Amount_Paid  App_Rating
1          499         4.8
3          199         4.1
4          499         4.9
7          499         4.7
9            0         4.1

In [33]:
high_usage_sessions = df[(df["Session_Duration"] > 60) & (df["Data_Used_MB"] > 500)]
print(high_usage_sessions)

   User_ID   Age       City  Session_Duration  Data_Used_MB Subscription_Type  \
3      504  28.0    Chennai              90.0         700.0             Basic
4      505  42.0      Delhi             120.0         900.0           Premium
7      508  26.0  Bangalore              70.0         600.0           Premium

   Amount_Paid  App_Rating
3          199         4.1
4          499         4.9
7          499         4.7

Revenue Condribution

In [34]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.000,Chennai,45.000000,300.000000,Free,0,4.200000
1,502,35.000,Bangalore,60.000000,550.000000,Premium,499,4.800000
2,503,31.375,Delhi,30.000000,200.000000,Free,0,3.900000
3,504,28.000,Chennai,90.000000,700.000000,Basic,199,4.100000
4,505,42.000,Delhi,120.000000,900.000000,Premium,499,4.900000
5,506,31.000,Bangalore,50.000000,450.000000,Basic,199,4.333333
6,507,31.375,Chennai,40.000000,320.000000,Free,0,4.000000
7,508,26.000,Bangalore,70.000000,600.000000,Premium,499,4.700000
8,509,38.000,Delhi,62.222222,500.000000,Basic,199,4.300000
9,510,29.000,Bangalore,55.000000,502.222222,Free,0,4.100000

In [35]:
revenu_condribution = df['Amount_Paid'].to_numpy()

In [36]:
revenu_condribution=np.sum(revenu_condribution)

In [37]:
print("Revenue Condribution :", revenu_condribution)

Revenue Condribution : 2094

Subscription Distribution

In [38]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.000,Chennai,45.000000,300.000000,Free,0,4.200000
1,502,35.000,Bangalore,60.000000,550.000000,Premium,499,4.800000
2,503,31.375,Delhi,30.000000,200.000000,Free,0,3.900000
3,504,28.000,Chennai,90.000000,700.000000,Basic,199,4.100000
4,505,42.000,Delhi,120.000000,900.000000,Premium,499,4.900000
5,506,31.000,Bangalore,50.000000,450.000000,Basic,199,4.333333
6,507,31.375,Chennai,40.000000,320.000000,Free,0,4.000000
7,508,26.000,Bangalore,70.000000,600.000000,Premium,499,4.700000
8,509,38.000,Delhi,62.222222,500.000000,Basic,199,4.300000
9,510,29.000,Bangalore,55.000000,502.222222,Free,0,4.100000

In [39]:
subscription_distribution = df["Subscription_Type"].value_counts()
print(subscription_distribution)

Subscription_Type
Free       4
Premium    3
Basic      3
Name: count, dtype: int64

Average Session Duration by Subscription

In [40]:
avg_session_by_sub = df.groupby("Subscription_Type")["Session_Duration"].mean()
print(avg_session_by_sub)

Subscription_Type
Basic      67.407407
Free       42.500000
Premium    83.333333
Name: Session_Duration, dtype: float64

Average Rating by City

In [41]:
avg_rating_by_city = df.groupby("City")["App_Rating"].mean()
print(avg_rating_by_city)

City
Bangalore    4.483333
Chennai      4.100000
Delhi        4.366667
Name: App_Rating, dtype: float64

Feature Engineering

In [43]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating
0,501,22.000,Chennai,45.000000,300.000000,Free,0,4.200000
1,502,35.000,Bangalore,60.000000,550.000000,Premium,499,4.800000
2,503,31.375,Delhi,30.000000,200.000000,Free,0,3.900000
3,504,28.000,Chennai,90.000000,700.000000,Basic,199,4.100000
4,505,42.000,Delhi,120.000000,900.000000,Premium,499,4.900000
5,506,31.000,Bangalore,50.000000,450.000000,Basic,199,4.333333
6,507,31.375,Chennai,40.000000,320.000000,Free,0,4.000000
7,508,26.000,Bangalore,70.000000,600.000000,Premium,499,4.700000
8,509,38.000,Delhi,62.222222,500.000000,Basic,199,4.300000
9,510,29.000,Bangalore,55.000000,502.222222,Free,0,4.100000

In [44]:
df["Usage_level"]=df["Session_Duration"].apply(lambda x: "low" if x <= 40 else "medium" if x <= 80 else "high")

In [45]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating,Usage_level
0,501,22.000,Chennai,45.000000,300.000000,Free,0,4.200000,medium
1,502,35.000,Bangalore,60.000000,550.000000,Premium,499,4.800000,medium
2,503,31.375,Delhi,30.000000,200.000000,Free,0,3.900000,low
3,504,28.000,Chennai,90.000000,700.000000,Basic,199,4.100000,high
4,505,42.000,Delhi,120.000000,900.000000,Premium,499,4.900000,high
5,506,31.000,Bangalore,50.000000,450.000000,Basic,199,4.333333,medium
6,507,31.375,Chennai,40.000000,320.000000,Free,0,4.000000,low
7,508,26.000,Bangalore,70.000000,600.000000,Premium,499,4.700000,medium
8,509,38.000,Delhi,62.222222,500.000000,Basic,199,4.300000,medium
9,510,29.000,Bangalore,55.000000,502.222222,Free,0,4.100000,medium

In [46]:
df["User_Type"]=df["Amount_Paid"].apply(lambda x: "Free User" if x==0 else "Paid User")

In [47]:
df

,User_ID,Age,City,Session_Duration,Data_Used_MB,Subscription_Type,Amount_Paid,App_Rating,Usage_level,User_Type
0,501,22.000,Chennai,45.000000,300.000000,Free,0,4.200000,medium,Free User
1,502,35.000,Bangalore,60.000000,550.000000,Premium,499,4.800000,medium,Paid User
2,503,31.375,Delhi,30.000000,200.000000,Free,0,3.900000,low,Free User
3,504,28.000,Chennai,90.000000,700.000000,Basic,199,4.100000,high,Paid User
4,505,42.000,Delhi,120.000000,900.000000,Premium,499,4.900000,high,Paid User
5,506,31.000,Bangalore,50.000000,450.000000,Basic,199,4.333333,medium,Paid User
6,507,31.375,Chennai,40.000000,320.000000,Free,0,4.000000,low,Free User
7,508,26.000,Bangalore,70.000000,600.000000,Premium,499,4.700000,medium,Paid User
8,509,38.000,Delhi,62.222222,500.000000,Basic,199,4.300000,medium,Paid User
9,510,29.000,Bangalore,55.000000,502.222222,Free,0,4.100000,medium,Free User